{
  "nome": "Gabriel Oliveria de Sousa Coelho",
  "profissao": "Engenheiro de Software | Backend Java & Spring Boot",
  "resumo": "Minha experiência é voltada principalmente para o backend em Java e Spring Boot, incluindo Spring Security, JPA/Hibernate, Swagger, além de integrações complexas via APIs REST, WebSockets e protocolos TCP/IP. Também atuo com bancos de dados relacionais como PostgreSQL, SQL Server e Oracle, aplicando boas práticas de modelagem, otimização e versionamento. No frontend, possuo conhecimento em React e Next.js, que utilizo de forma complementar em projetos. Além disso, aplico práticas de DevOps, testes, logs estruturados e monitoramento para garantir confiabilidade em produção. Trabalho com princípios de SOLID, Clean Code e Arquitetura Hexagonal, sempre com foco em criar sistemas sustentáveis e fáceis de manter. Também sou ativo na comunidade, compartilhando projetos e aprendizados no GitHub. Objetivo: Evoluir continuamente como arquiteto de software, participando de projetos que desafiem a engenharia e entreguem impacto real para negócios e pessoas.",
  "experiencia": [
    {
      "cargo": "Desenvolvedor Full Stack Java - Pleno",
      "empresa": "Telemática Sistemas Inteligentes",
      "periodo": "julho de 2023 - Presente (2 anos 5 meses)",
      "descricao": "Experiência em bancos de dados Oracle, SQL Server e PostgreSQL, com foco em modelagem, queries otimizadas, procedures e manutenção de dados críticos. Implementação de Spring Security com JWT (Auth0) para autenticação e autorização seguras. Criação e manutenção de APIs REST de alta performance, integradas a sistemas internos e externos. Atuação em sistemas de comunicação baseados no protocolo TCP/IP, incluindo drivers de comunicação, sockets e integrações assíncronas. Experiência em Sistemas de Gestão de Acesso, com foco em permissões e controle, portaria de gestão de pontos (1510 e 671) em dispositivos. Participação em projetos de Sistemas de Integração entre múltiplas plataformas, promovendo interoperabilidade e consistência de dados. Desenvolvimento de softwares customizados, adequados às necessidades específicas de clientes e projetos estratégicos. Envolvimento ativo em cerimônias ágeis para definição de requisitos, priorização de entregas e colaboração com times multidisciplinares."
    }
  ],
  "formacao": [
    {
      "instituicao": "Full Cycle",
      "curso": "MBA, Arquitetura de Software",
      "periodo": "junho de 2025 - dezembro de 2026"
    },
    {
      "instituicao": "Unoeste",
      "curso": "CST, Análise e Desenvolvimento de Sistemas",
      "periodo": "fevereiro de 2022 - julho de 2024"
    },
    {
      "instituicao": "Microlins",
      "curso": "Técnico, Hardware"
    }
  ],
  "contato": {
    "telefone": "(19) 99735-7450",
    "email": "gabriel.coelho.hgc@outlook.com.br",
    "linkedin": "https://www.linkedin.com/in/ocoelhogabriel",
    "github": "https://github.com/ocoelhogabriel"
  },
  "habilidades": [
    "Spring Framework",
    "Spring MVC",
    "Spring Boot",
    "Swagger API",
    "Java",
    "PostgreSQL",
    "Hibernate",
    "JPA (Java Persistence API)",
    "REST (Transferência de estado representacional )",
    "API REST",
    "XML",
    "Docker",
    "Business",
    "RabbitMQ",
    "PL/SQL",
    "Documentação",
    "Realização de testes",
    "Kanban",
    "Servidor Apache",
    "Metodologias Agile",
    "Scrum",
    "Programação (computação)",
    "Desenvolvimento Java",
    "Pilha de protocolos TCP/IP",
    "WebSocket",
    "Serviços Web RESTful",
    "Princípios SOLID",
    "JSON Web Token (JWT)",
    "Servidor Linux",
    "Microsoft SQL Server",
    "React.js",
    "Git",
    "Node.js",
    "MySQL",
    "React Native",
    "GitHub",
    "TypeScript",
    "Next.js",
    "JavaScript",
    "HTML5",
    "CSS"
  ]
}
